[
  {
    "title": "Gallery App",
    "image": "https://play-lh.googleusercontent.com/Sy_9xv0fpbnc6bJgYM_DGj7-BhleftZgjbeFmvcN5eMGnoizMl2igd5IfJEq82xKZw8",
    "discrption": "Gallery App is a simple, elegant, and lightweight application designed for seamless image viewing. With its clean and intuitive user interface, this app ensures a smooth and enjoyable experience for users. Its fast performance and minimalistic design make it perfect for browsing and organizing images with ease.Developed using React.js, the Gallery App is a frontend-only project focused on providing a modern and visually appealing layout. The user interface has been carefully crafted to enhance image viewing, offering features that prioritize simplicity and usability. Whether you're looking to showcase your favorite photos or browse through collections effortlessly, this app is designed to deliver both functionality and style",
    "category": "Web App",
    "url": "gallery.app",
    "Rate": 5
  },
  {
    "title": "Weather App",
    "image": "https://purepng.com/public/uploads/large/purepng.com-weather-iconsymbolsiconsapple-iosiosios-8-iconsios-8-721522596142qx4ep.png",
    "discrption": "An elegant, efficient app for real-time weather updates. Its clean, user-friendly interface ensures smooth navigation and fast, accurate forecasts. Built with React.js and integrated with a weather API, this frontend-only app delivers key data like current temperature, conditions, wind speed, and a 5-day forecast in a visually appealing layout. Users can search by city or use geolocation for instant updates. The minimalistic design prioritizes functionality, making weather info easy to access and understand. Fully responsive, it offers an optimized experience across both desktop and mobile devices..",
    "category": "Web App",
    "url": "weather.app",
    "Rate": 5
  },
  {
    "title": "Div Manage App",
    "image": "https://shotkit.com/wp-content/uploads/2020/09/luminar-presets-1.jpg",
    "discrption": "The Div Management System empowers you to control individual <div> elements with ease. Its intuitive interface lets you adjust properties such as height, width, box shadow, animations, and 3D transforms—including Z-axis rotations—in real time, eliminating the need for complex code. This tool offers precise sizing, dynamic visual effects, and smooth transitions to enhance your web page’s interactivity and visual appeal. Designed for desktop use, it automatically displays a mobile-friendly notice advising users to switch devices for the best experience. Powered by Tailwind CSS, the system combines simplicity and advanced design capabilities to help you fine-tune your layouts effortlessly.",
    "category": "Web App",
    "url": "divmanage.app",
    "Rate": 4
  }
]
