[
  {
    "title": "Java Script",
    "image": "https://cdn.pixabay.com/photo/2015/04/23/17/41/javascript-736400_1280.png",
    "discrption": "I have a solid foundation in JavaScript, enabling me to create interactive web experiences. I effectively handle events like clicks and key presses, allowing me to respond to user actions dynamically. My skills include manipulating the DOM to change styles and content in real time. Additionally, I am exploring CSS animations and integrating them with JavaScript to enhance visual effects on the website. This combination of skills allows me to build engaging and responsive web applications that meet client needs.",
    "category": ["Web Development"],
    "Rate": 5,
    "Progress":100
  },
  {
    "title": "React Js",
    "image": "https://upload.wikimedia.org/wikipedia/commons/a/a7/React-icon.svg",
    "discrption": "I have a solid understanding of React, enabling me to build dynamic and interactive web applications. I am skilled in creating functional components, utilizing hooks like useEffect to manage side effects and component lifecycle events. I can effectively manipulate the DOM and apply styles, including defining CSS animations directly within components. My experience allows me to create responsive layouts and integrate various APIs seamlessly, ensuring a smooth user experience. I am committed to following best practices and keeping up with the latest advancements in the React ecosystem to deliver high-quality results.",
    "category": ["Web Development"],
    "Rate": 5,
    "Progress":70
  },
  {
    "title": "HTML",
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/61/HTML5_logo_and_wordmark.svg",
    "discrption": "I possess a strong understanding of HTML, which is the foundation of web development. I am skilled in structuring web pages using semantic HTML elements, ensuring accessibility and search engine optimization. I can effectively create forms, tables, and multimedia content, enhancing user experience. My proficiency extends to integrating HTML with CSS and JavaScript, allowing for the development of dynamic and responsive layouts. I stay updated with best practices and standards to deliver clean, well-organized code that meets client requirements.",
    "category": ["Web Development"],
    "Rate": 5,
    "Progress":100
  },
  {
    "title": "TypeScript",
    "image": "https://static-00.iconduck.com/assets.00/typescript-icon-256x256-nuvyqkqx.png",
    "discrption": "I have a strong understanding of TypeScript, which enhances the development process by adding static types to JavaScript. This allows for better code clarity, refactoring, and early error detection. I can define complex types and interfaces, manage asynchronous code with ease, and use generics for reusable code. My experience includes integrating TypeScript into existing JavaScript codebases, working with various frameworks such as React and Node.js, and improving overall maintainability and scalability of web applications.",
    "category": ["Web Development", "Programming Languages"],
    "Rate": 5,
    "Progress": 85
  },  
  {
    "title": "CSS",
    "image": "https://upload.wikimedia.org/wikipedia/commons/d/d5/CSS3_logo_and_wordmark.svg",
    "discrption": "I possess a strong understanding of CSS, enabling me to create visually appealing and responsive designs. My expertise includes using modern CSS techniques, such as Flexbox and Grid layout, to build user-friendly interfaces. I am also skilled in implementing animations and transitions to enhance the user experience, ensuring that websites are both aesthetically pleasing and functionally effective.",
    "category": ["Web Development"],
    "Rate": 5,
    "Progress":100
  },
  {
    "title": "Python",
    "image": "https://www.svgrepo.com/show/303532/python-3-logo.svg",
    "discrption": "I have a solid foundation in Python, enabling me to develop robust applications and automate tasks effectively. My experience includes working with popular libraries and frameworks such as  Django for web development, as well as data analysis using Pandas and NumPy. I am adept at writing clean, efficient code and leveraging Python's versatility to solve complex problems, ensuring high-quality deliverables for my clients.",
    "category": ["Programming Language","API Engineering","AI","Back-End","Data Analysis"],
    "Rate": 4,
    "Progress":80
  },
  {
    "title": "Django",
    "image": "https://www.svgrepo.com/show/349341/djangoproject.svg",
    "discrption": "I have extensive experience in using Django and Django REST Framework to build scalable and efficient web applications. My skills include designing RESTful APIs, managing database interactions, and implementing user authentication and authorization. I am proficient in leveraging Django's powerful features, such as its ORM and admin interface, to create robust backend solutions. With a focus on clean architecture and best practices, I ensure high performance and maintainability in all my projects.",
    "category": ["Web Development","API Engineering","Back-End"],
    "Rate": 3,
    "Progress":70
  },
  {
    "title": "GitHub",
    "image": "https://upload.wikimedia.org/wikipedia/commons/9/91/Octicons-mark-github.svg",
    "discrption": "I have a strong understanding of Git and GitHub, allowing me to efficiently manage version control and collaborate effectively on projects. My skills include creating and managing repositories, branching and merging code, and utilizing Git workflows to streamline development processes. I am proficient in resolving conflicts and conducting code reviews, ensuring that code quality is maintained. With GitHub, I leverage its powerful features for continuous integration and deployment, enhancing collaboration and project visibility",
    "category": ["Version Control System"],
    "Rate": 5,
    "Progress":85
  },
  {
    "title": "C",
    "image": "https://upload.wikimedia.org/wikipedia/commons/1/19/C_Logo.png",
    "discrption": "I have a foundational understanding of C, which has helped me grasp how computers and programming languages work at a deeper level. Through the CS50x course, I learned concepts such as loops, conditionals, and pointers. While I do not actively work with C, my knowledge of this language enhances my overall programming comprehension and problem-solving abilities.",
    "category": "Programming Foundations",
    "Rate": 2,
    "Progress":30
  },
  {
    "title": "Pandas",
    "image": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Pandas_logo.svg",
    "description": "I am familiar with the basics of the Pandas library, including working with DataFrames and Series to organize and manipulate data. I can perform simple tasks like reading data from CSV files, filtering rows, and selecting specific columns. While I am still exploring its advanced features, I understand its importance in data analysis and plan to deepen my knowledge over time.",
    "category": ["Data Analysis", "Data Science", "Python", "Data Manipulation"],
    "Rate": 5,
    "Progress":10
  },
  {
    "title": "NumPy",
    "image": "https://th.bing.com/th/id/OIP.Wm9ILybJbJOZLbmvnFyN7AHaDV?rs=1&pid=ImgDetMain",
    "discrption": "I have a foundational understanding of NumPy, including its array operations, mathematical functions, and broadcasting. I can efficiently perform array manipulations, linear algebra, and statistical tasks. My goal is to strengthen my knowledge in numerical computations for data analysis.",
    "category": ["Data Analysis", "Python", "Mathematics", "Scientific Computing"],
    "Rate": 4,
    "Progress":50
  },
  {
    "title": "Streamlit",
    "discrption": "Currently learning Streamlit to build interactive data apps. While not yet fully confident, I'm actively gaining experience. Streamlit is a powerful tool for creating data-driven web applications with minimal effort, and I'm excited to explore its capabilities. With continued practice and hands-on projects, I am confident I will become proficient in developing engaging, user-friendly data applications using Streamlit.",
    "image": "https://th.bing.com/th/id/R.ff47037fa9ab89dd8d77c8ababc7d8c9?rik=dIJIqEqY%2bkYNLA&pid=ImgRaw&r=0",
    "category": ["Data Analysis","Web Development","Python"],
    "Rate": 3,
    "Progress":10
  },
  {
    "title": "Project Management",
    "discrption": "Planning to develop project management skills in the future. I aim to gain a deeper understanding of the methodologies and tools used in managing projects effectively. With a focus on organization, communication, and leadership, I look forward to learning how to oversee and drive projects to successful completion.",
    "image": "https://th.bing.com/th/id/OIP.qAUue9YSTGKbCV6dEpJ0-QHaDy?w=2048&h=1046&rs=1&pid=ImgDetMain",
    "category": "Professional Skills",
    "Rate": 5,
    "Progress":10
  },
  {
    "title": "Artificial Intelligence (AI)",
    "discrption": "In the future, I plan to focus on learning and applying artificial intelligence (AI). I am excited to explore the various AI techniques such as machine learning, deep learning, and natural language processing. I aim to gain expertise in creating intelligent systems that can make decisions and learn from data. As I gain hands-on experience, I hope to apply AI to real-world problems and projects. With a strong foundation in programming and data analysis, I am confident in my ability to excel in the field of artificial intelligence.",
    "image": "https://th.bing.com/th/id/OIP.u-LGMDwMFZZLdIhk3ehnawHaE8?rs=1&pid=ImgDetMain",
    "category": ["Future Skills","AI"],
    "Rate": 5,
    "Progress":5
  },
  {
    "title": "Flutter",
    "discrption": "In the future, I plan to learn Flutter for building cross-platform mobile applications. Flutter allows for the development of high-performance apps for both iOS and Android using a single codebase. I am eager to explore its capabilities in creating beautiful and responsive mobile UIs, and I look forward to gaining hands-on experience to develop mobile apps efficiently and effectively. With my background in web development and programming, I am confident in my ability to master Flutter and create engaging mobile applications.",
    "image": "https://th.bing.com/th/id/OIP.10RECXGTH5NyaeBg5yD1pwHaDp?rs=1&pid=ImgDetMain",
    "category": ["Future Skills","Moble App Development"],
    "Rate": 4,
    "Progress":0
  },
  {
    "title": "Problem Solving",
    "discrption": "In the future, I plan to enhance my problem-solving skills to tackle complex challenges in software development. I aim to focus on algorithms, data structures, and logical thinking to improve my ability to approach problems systematically. Mastering problem-solving will allow me to write more efficient code, optimize performance, and approach coding challenges with confidence. I will practice regularly through platforms like LeetCode, Codeforces, and others to strengthen my skills. With dedication and persistence, I am confident in my ability to become a proficient problem solver.",
    "image": "https://th.bing.com/th/id/OIP.kB7PFXpaBSNXD4efHUiargHaD2?rs=1&pid=ImgDetMain",
    "category": ["Future Skills"],
    "Rate": 4,
    "Progress":40
  },
  {
    "title": "Unreal Engine",
    "discrption": "Learning Unreal Engine for game development. Exploring its powerful tools for creating stunning graphics, environments, and interactive gameplay. I am excited to delve into game design and development, leveraging Unreal Engine's capabilities to bring creative ideas to life. With a focus on learning Blueprints and C++ programming within the engine, I aim to build engaging and immersive gaming experiences. As I gain hands-on experience, I look forward to creating my own games and projects using Unreal Engine. Through practice and experimentation, I am confident in my ability to excel in game development.",
    "image": "https://th.bing.com/th/id/OIP.eUCEBcs5pStm6lSEUlM1KQHaE8?rs=1&pid=ImgDetMain",
    "category": ["Future Skills"],
    "Rate": 3,
    "Progress":0
  },
  {
    "title": "Next JS",
    "discrption": "Learning Unreal Engine for game development. Exploring its powerful tools for creating stunning graphics, environments, and interactive gameplay. I am excited to delve into game design and development, leveraging Unreal Engine's capabilities to bring creative ideas to life. With a focus on learning Blueprints and C++ programming within the engine, I aim to build engaging and immersive gaming experiences. As I gain hands-on experience, I look forward to creating my own games and projects using Unreal Engine. Through practice and experimentation, I am confident in my ability to excel in game development.",
    "image": "https://i.pinimg.com/736x/5e/b9/5e/5eb95eaf598d1007befaa78d038c2b2f.jpg",
    "category": ["Future Skills","Web Development","Server Side Rendering"],
    "Rate": 3,
    "Progress":0
  },
    {
      "title": "Matplotlib",
      "discrption": "Exploring Matplotlib for data visualization in Python. This language is in my future learning plan. Learning to create a wide range of plots, charts, and graphs to effectively analyze and present data. Mastering customization and styling to make data insights more comprehensible.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/8/84/Matplotlib_icon.svg",
      "category": ["Data Visualization", "Data Analysis", "Python", "Plotting"],
      "Rate": 3,
      "Progress":0
    },
    {
      "title": "Seaborn",
      "discrption": "Diving into Seaborn for advanced statistical data visualization. This language is in my future learning plan. Learning how to generate informative and aesthetically pleasing visualizations that make complex data easier to understand.",
      "image": "https://seaborn.pydata.org/_images/logo-mark-lightbg.svg",
      "category": ["Data Visualization", "Python", "Data Analysis", "Plotting"],
      "Rate": 3,
      "Progress":0
    },
    {
      "title": "OpenCV",
      "discrption": "Learning OpenCV for computer vision applications. This language is in my future learning plan. Exploring image processing, object detection, and real-time video analysis. Excited to build AI-powered vision projects with OpenCV.",
      "image": "https://opencv.org/wp-content/uploads/2020/07/OpenCV_logo_black.png",
      "category": ["Computer Vision", "Python", "Data Analysis", "Image Processing", "Machine Learning"],
      "Rate": 4,
      "Progress":0
    },
    {
      "title": "LangChain",
      "discrption": "Studying LangChain for developing applications powered by large language models. This language is in my future learning plan. Exploring how to chain LLMs together to build powerful AI-driven solutions and chatbots.",
      "image": "https://th.bing.com/th/id/OIP.mzcbieY6QvKTi_ZlgtuBEQHaHa?rs=1&pid=ImgDetMain",
      "category": ["AI", "Machine Learning", "Natural Language Processing", "Python", "Frameworks","Future Skill"],
      "Rate": 4,
      "Progress":50
    },
    {
      "title": "LangGraph",
      "discrption": "Exploring LangGraph for building complex LLM workflows. This language is in my future learning plan. Learning how to create structured, multi-step AI applications using graph-based reasoning and AI agents.",
      "image": "https://th.bing.com/th/id/OIP.kN3S7RHRyD3Vy11ovM9cgwHaDt?rs=1&pid=ImgDetMain",
      "category": ["AI", "Machine Learning", "Natural Language Processing", "Graph Databases", "Python", "Frameworks","Future Skill"],
      "Rate": 4,
      "Progress":0
    },
    {
      "title": "PyTorch",
      "discrption": "Learning PyTorch for deep learning and AI model development. This language is in my future learning plan. Exploring neural networks, training algorithms, and working with large datasets to create powerful AI applications.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/1/10/PyTorch_logo_icon.svg",
      "category": ["AI", "Machine Learning", "Deep Learning", "Python", "Frameworks","Future Skill"],
      "Rate": 5,
      "Progress":0
    },
    {
      "title": "TensorFlow",
      "discrption": "Exploring TensorFlow for building and training machine learning models. This language is in my future learning plan. Learning about neural networks, deep learning, and deployment strategies for AI solutions.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Tensorflow_logo.svg",
      "category": ["AI", "Machine Learning", "Deep Learning", "Python", "Frameworks","Future Skill"],
      "Rate": 5,
      "Progress":0
    },
    {
      "title": "Scikit-Learn",
      "discrption": "Mastering Scikit-Learn for machine learning applications. This language is in my future learning plan. Learning about classification, regression, clustering, and model evaluation techniques to build powerful AI solutions.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/0/05/Scikit_learn_logo_small.svg",
      "category": ["AI", "Machine Learning", "Data Science", "Python", "Libraries","Future Skill"],
      "Rate": 4,
      "Progress":0
    }  
]
